jmeter_tests/test_plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0">
    <hashTree>
        <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Pruebas CCP" enabled="true">
            <stringProp name="TestPlan.comments">Plan de pruebas para bodega y ventas</stringProp>
            <hashTree>
                <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Usuarios Concurrentes" enabled="true">
                    <stringProp name="ThreadGroup.num_threads">10</stringProp>
                    <stringProp name="ThreadGroup.ramp_time">5</stringProp>
                    <stringProp name="ThreadGroup.duration">30</stringProp>
                    <hashTree>
                        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Consulta Inventario Bodega" enabled="true">
                            <stringProp name="HTTPSampler.domain">bodega</stringProp>
                            <stringProp name="HTTPSampler.port">5001</stringProp>
                            <stringProp name="HTTPSampler.protocol">http</stringProp>
                            <stringProp name="HTTPSampler.path">/bodega/inventario</stringProp>
                            <stringProp name="HTTPSampler.method">GET</stringProp>
                        </HTTPSamplerProxy>
                        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Crear Orden de Venta" enabled="true">
                            <stringProp name="HTTPSampler.domain">ventas</stringProp>
                            <stringProp name="HTTPSampler.port">5002</stringProp>
                            <stringProp name="HTTPSampler.protocol">http</stringProp>
                            <stringProp name="HTTPSampler.path">/ventas/orden</stringProp>
                            <stringProp name="HTTPSampler.method">POST</stringProp>
                            <stringProp name="HTTPSampler.postBodyRaw">
                                {"cliente_id": "12345", "productos": [{"id": "p001", "cantidad": 3}]}
                            </stringProp>
                        </HTTPSamplerProxy>
                    </hashTree>
                </ThreadGroup>
            </hashTree>
        </TestPlan>
    </hashTree>
</jmeterTestPlan>